Австралия/src/AccumulationRegisters/TransferOrders/TransferOrders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>TransferOrders</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ShipmentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransferOrder</name>
    <type>
      <types>DocumentRef.TransferOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/TransferOrders/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public 

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	TransferOrders.LineNumber AS LineNumber,
	|	TransferOrders.Company AS Company,
	|	TransferOrders.TransferOrder AS TransferOrder,
	|	TransferOrders.Products AS Products,
	|	TransferOrders.Characteristic AS Characteristic,
	|	TransferOrders.Quantity AS QuantityBeforeWrite,
	|	TransferOrders.Quantity AS QuantityChange,
	|	TransferOrders.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsTransferOrdersChange
	|FROM
	|	AccumulationRegister.TransferOrders AS TransferOrders");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsTransferOrdersChange", False);
	
EndProcedure

#EndRegion

#EndIf
